tests/fixtures/billing_requests.json

{ 
  "list": {
    "method": "GET",
    "path_template": "/billing_requests",
    "url_params": [],
    "body": {"billing_requests":[{"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 4425","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 1318","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 4059"},"metadata":{},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2081"},"metadata":{},"scheme":"faster_payments"},"status":"pending"},{"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 694","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 8511","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 456"},"metadata":{},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 3300"},"metadata":{},"scheme":"faster_payments"},"status":"pending"}],"meta":{"cursors":{"after":"example after 8162","before":"example before 5089"},"limit":50}}
  },
  "create": {
    "method": "POST",
    "path_template": "/billing_requests",
    "url_params": [],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 8047"],"bank_authorisation":{"adapter":"example adapter 495","authorisation_type":"example authorisation_type 5466","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 6258"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":false,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 9106","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 3237","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 3274"},"metadata":{},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 8287"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 1445"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 1211"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "get": {
    "method": "GET",
    "path_template": "/billing_requests/:identity",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 5429"],"bank_authorisation":{"adapter":"example adapter 5541","authorisation_type":"example authorisation_type 408","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 6831"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":false,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 631","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 1485","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 3015"},"metadata":{},"scheme":"bacs","verify":"when_available"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2888"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 1737"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 5356"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "collect_customer_details": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/collect_customer_details",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 4078"],"bank_authorisation":{"adapter":"example adapter 5194","authorisation_type":"example authorisation_type 563","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 4147"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 6413","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 3090","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 3721"},"metadata":{},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 4324"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 6159"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 1353"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "collect_bank_account": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/collect_bank_account",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 2451"],"bank_authorisation":{"adapter":"example adapter 2888","authorisation_type":"example authorisation_type 4538","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 9355"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 3000","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 8705","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 8266"},"metadata":{},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2199"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 8510"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 2605"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "fulfil": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/fulfil",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 7996"],"bank_authorisation":{"adapter":"example adapter 5447","authorisation_type":"example authorisation_type 5094","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 7463"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 4783","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 5746","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 7202"},"metadata":{},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 9718"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 1563"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 4376"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "choose_currency": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/choose_currency",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 59"],"bank_authorisation":{"adapter":"example adapter 953","authorisation_type":"example authorisation_type 1137","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 9241"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 2002","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 3891","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 8623"},"metadata":{},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 9336"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 3033"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 8643"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "confirm_payer_details": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/confirm_payer_details",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 1598"],"bank_authorisation":{"adapter":"example adapter 1351","authorisation_type":"example authorisation_type 1515","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 2205"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 9107","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 2546","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 6503"},"metadata":{},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 9843"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 3687"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 9757"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "cancel": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/cancel",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 3098"],"bank_authorisation":{"adapter":"example adapter 5285","authorisation_type":"example authorisation_type 8590","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 3632"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":true,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 5384","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 8582","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 8591"},"metadata":{},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 1297"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 9267"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 6137"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "notify": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/notify",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 2079"],"bank_authorisation":{"adapter":"example adapter 5894","authorisation_type":"example authorisation_type 7726","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 3981"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":false,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 9819","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 3086","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 6052"},"metadata":{},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 9271"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 1270"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 2066"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "fallback": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/fallback",
    "url_params": ["BRQ123"],
    "body": {"billing_requests":{"actions":[{"available_currencies":["example available_currencies 3749"],"bank_authorisation":{"adapter":"example adapter 7175","authorisation_type":"example authorisation_type 4885","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 1387"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","fallback_enabled":false,"id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 1528","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 2818","mandate_request":"MRQ123","mandate_request_mandate":"MD123","organisation":"OR123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 1224"},"metadata":{},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":1000,"app_fee":100,"currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 4547"},"metadata":{},"scheme":"faster_payments"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 1532"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 3612"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  }
}
